backend/app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres"
---
    def index
        genres = Genre.all