backend/app/controllers/movies_controller.rb

    def index
        tmdb_key = ENV["TMDB_API_KEY"]

        #gets movie recommendations
        movieRecommendations = RestClient.get("https://api.themoviedb.org/3/movie/525/recommendations?api_key=#{tmdb_key}&language=en-US&page=1")
---
SELECT "movies".* FROM "movies"

    def search
        tmdb_key = ENV["TMDB_API_KEY"]

        # SEARCHES MOVIES BY USER INPUT
        movieSearch = RestClient.get("https://api.themoviedb.org/3/search/movie?api_key=#{tmdb_key}&language=en-US&page=1&query=#{params['searchTerm']}&include_adult=false")
---
SELECT "movies".* FROM "movies"