backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "test user"], ["password", "password"], ["created_at", "2020-02-04 16:10:32.019647"], ["updated_at", "2020-02-04 16:10:32.019647"]]
---
    def create
        user = User.create(
            username: params[:username],
            password: params[:password],
            name: params[:name],
            bio: params[:bio],
            img: params[:img],
            region: params[:region],
            birthday: params[:birthday]
        )

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Other Matt"], ["LIMIT", 1]]
---
    def login
        currentUser = User.find_by(username: params[:username])